In [65]:
## scraping the data with Ai
import pandas as pd
import numpy as np

In [2]:
df_delivery=pd.read_csv("extract-data-from-women-kurtis-buy-women-kurtis-online-starting-at-just-indian-rupee111-or-meesho_delivery_captured-list_2023-12-03_5087c1c3-8444-43bf-bc28-177259abf659.csv")
df_delivery.head(3)

   Position Delivery_status
0         1   Free Delivery
1         2   Free Delivery
2         3   Free Delivery

In [3]:
df_name=pd.read_csv("extract-data-from-women-kurtis-buy-women-kurtis-online-starting-at-just-indian-rupee111-or-meesho_krutis_name_captured-list_2023-12-03_5087c1c3-8444-43bf-bc28-177259abf659.csv")

In [4]:
df_name.head(3)

   Position                 kruti_name
0         1     Aishani Refined Kurtis
1         2  Trendy Sensational Kurtis
2         3  Banita Sensational Kurtis

In [5]:
df_price= pd.read_csv("extract-data-from-women-kurtis-buy-women-kurtis-online-starting-at-just-indian-rupee111-or-meesho_prices_captured-list_2023-12-03_5087c1c3-8444-43bf-bc28-177259abf659.csv")
df_price.head(4)

   Position         price
0         1  ₹712 onwards
1         2  ₹170 onwards
2         3  ₹280 onwards
3         4  ₹275 onwards

In [6]:
df_rateings=pd.read_csv("extract-data-from-women-kurtis-buy-women-kurtis-online-starting-at-just-indian-rupee111-or-meesho_reviews_captured-list_2023-12-03_5087c1c3-8444-43bf-bc28-177259abf659.csv")
df_rateings.head(3)

   Position            rateings
0         1       4.0\nSupplier
1         2  3.8\n28042 Reviews
2         3  4.0\n62010 Reviews

In [7]:
df_finale= pd.merge(df_rateings,df_price, on="Position")

In [8]:
df_final= pd.merge(df_name,df_delivery,on="Position")

In [9]:
df_final.head(4)

   Position                 kruti_name Delivery_status
0         1     Aishani Refined Kurtis   Free Delivery
1         2  Trendy Sensational Kurtis   Free Delivery
2         3  Banita Sensational Kurtis   Free Delivery
3         4    Aagam Attractive Kurtis   Free Delivery

In [10]:
df_all=pd.merge(df_finale,df_final,on="Position")

In [11]:
df_all.head(3)

,Position,rateings,price,kruti_name,Delivery_status
0,1,4.0\nSupplier,₹712 onwards,Aishani Refined Kurtis,Free Delivery
1,2,3.8\n28042 Reviews,₹170 onwards,Trendy Sensational Kurtis,Free Delivery
2,3,4.0\n62010 Reviews,₹280 onwards,Banita Sensational Kurtis,Free Delivery

# Summary of the data 
 this data ecommerece website specifically kurti section data. 
 
** columns are reviews- the column contain both stars and no_of_reviews**
 
** price- cost of items**

** kurti_name- name of the item**

** Delivery status- it spacifies either it is free delivery or need paid deivery**

## Dirty errors
#1. only one missing values that is in rateings (completeness)




## Messy errors
#1. in ratings column there are two information written one stars and other no_of_reviews
#2. price column "onwards" column will be deleted

In [12]:
#no duplicated values
df_all.duplicated().sum()

0

In [13]:
df_all.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Position         20 non-null     int64
 1   rateings         19 non-null     object
 2   price            20 non-null     object
 3   kruti_name       20 non-null     object
 4   Delivery_status  20 non-null     object
dtypes: int64(1), object(4)
memory usage: 960.0+ bytes

In [14]:
df_all.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Position         20 non-null     int64
 1   rateings         19 non-null     object
 2   price            20 non-null     object
 3   kruti_name       20 non-null     object
 4   Delivery_status  20 non-null     object
dtypes: int64(1), object(4)
memory usage: 960.0+ bytes

In [15]:
#df_all["price"].str.split(" ")[0][0]
##code
price=df_all["price"].str.split(" ")
cost= []

for i  in price:
    #print(i[0])
    cost.append(i[0])

In [16]:
print(type(cost))

<class 'list'>

In [17]:
df_all.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Position         20 non-null     int64
 1   rateings         19 non-null     object
 2   price            20 non-null     object
 3   kruti_name       20 non-null     object
 4   Delivery_status  20 non-null     object
dtypes: int64(1), object(4)
memory usage: 960.0+ bytes

In [18]:
## cost dtype is object changes to int first deleting Rs symbol from data
##code
new_cost = [item.replace("₹", "") for item in cost]

In [19]:
#new_cost= remove_dollar_symbol(cost)
##testing
print(new_cost)

['712', '170', '280', '275', '320', '275', '186', '272', '416', '275', '111', '327', '325', '289', '312', '277', '295', '237', '333', '311']

In [20]:
#combining in dataset as a new column
df_all["cost"]=new_cost

In [21]:
df_all.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Position         20 non-null     int64
 1   rateings         19 non-null     object
 2   price            20 non-null     object
 3   kruti_name       20 non-null     object
 4   Delivery_status  20 non-null     object
 5   cost             20 non-null     object
dtypes: int64(1), object(5)
memory usage: 1.1+ KB

In [22]:
## as cost have object data type so converting into integer
df_all["cost"]=df_all["cost"].astype("int64")

In [23]:
df_all.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Position         20 non-null     int64
 1   rateings         19 non-null     object
 2   price            20 non-null     object
 3   kruti_name       20 non-null     object
 4   Delivery_status  20 non-null     object
 5   cost             20 non-null     int64
dtypes: int64(2), object(4)
memory usage: 1.1+ KB

In [24]:
df_all.drop("Position",inplace=True,axis=1)
df_all.drop("price",inplace=True,axis=1)

In [25]:
df_all.head(5)

,rateings,kruti_name,Delivery_status,cost
0,4.0\nSupplier,Aishani Refined Kurtis,Free Delivery,712
1,3.8\n28042 Reviews,Trendy Sensational Kurtis,Free Delivery,170
2,4.0\n62010 Reviews,Banita Sensational Kurtis,Free Delivery,280
3,3.9\n3731 Reviews,Aagam Attractive Kurtis,Free Delivery,275
4,4.2\n14263 Reviews,Women Rayon Flared Printed Orange Kurti,Free Delivery,320

In [58]:
## separating the ratings list into two first stars and no_of_reviews as the ratings section have two columns combine
#code
list2=df_all["rateings"].str.split("\n").str.get(0)
list3=df_all["rateings"].str.split("\n").str.get(1)

In [61]:
df_all["stars"]=list2
df_all["no_of_reviews"]=list3

In [62]:
##testing 
df_all.head(4)

,rateings,kruti_name,Delivery_status,cost,stars,no_of_reviews
0,4.0\nSupplier,Aishani Refined Kurtis,Free Delivery,712,4.0,Supplier
1,3.8\n28042 Reviews,Trendy Sensational Kurtis,Free Delivery,170,3.8,28042 Reviews
2,4.0\n62010 Reviews,Banita Sensational Kurtis,Free Delivery,280,4.0,62010 Reviews
3,3.9\n3731 Reviews,Aagam Attractive Kurtis,Free Delivery,275,3.9,3731 Reviews

In [63]:
## dropping columns as rateings is no longer needed
df_all.drop("rateings",inplace= True, axis=1)

In [64]:
df_all.head()

,kruti_name,Delivery_status,cost,stars,no_of_reviews
0,Aishani Refined Kurtis,Free Delivery,712,4.0,Supplier
1,Trendy Sensational Kurtis,Free Delivery,170,3.8,28042 Reviews
2,Banita Sensational Kurtis,Free Delivery,280,4.0,62010 Reviews
3,Aagam Attractive Kurtis,Free Delivery,275,3.9,3731 Reviews
4,Women Rayon Flared Printed Orange Kurti,Free Delivery,320,4.2,14263 Reviews

In [82]:
##in the no_of_reviews column one "supplier" is written so replacing it by not found
mapping_dict = {"not": np.nan} # add other mappings if needed

df_all["no_of_reviews"] = df_all["no_of_reviews"].replace(mapping_dict)

In [83]:
df_all.head(4)

                  kruti_name Delivery_status  cost stars no_of_reviews
0     Aishani Refined Kurtis   Free Delivery   712   4.0           NaN
1  Trendy Sensational Kurtis   Free Delivery   170   3.8         28042
2  Banita Sensational Kurtis   Free Delivery   280   4.0         62010
3    Aagam Attractive Kurtis   Free Delivery   275   3.9          3731

In [77]:
##to take out only the numbers out of the strings
df_all["no_of_reviews"]=df_all["no_of_reviews"].str.split(" ").str.get(0)

In [85]:
df_all.head(6)

,kruti_name,Delivery_status,cost,stars,no_of_reviews
0,Aishani Refined Kurtis,Free Delivery,712,4.0,NaN
1,Trendy Sensational Kurtis,Free Delivery,170,3.8,28042
2,Banita Sensational Kurtis,Free Delivery,280,4.0,62010
3,Aagam Attractive Kurtis,Free Delivery,275,3.9,3731
4,Women Rayon Flared Printed Orange Kurti,Free Delivery,320,4.2,14263
5,Jivika Refined Kurtis,Free Delivery,275,4.0,4548

In [100]:
## as the stars column is in object dtype so converting into float
df_all["stars"]=df_all["stars"].astype(float)

In [101]:
df_all.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   kruti_name       20 non-null     object
 1   Delivery_status  20 non-null     object
 2   cost             20 non-null     int64
 3   stars            19 non-null     float64
 4   no_of_reviews    18 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 1.5+ KB

In [103]:
df_all["no_of_reviews"]=df_all["no_of_reviews"].astype(float)

In [104]:
df_all.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   kruti_name       20 non-null     object
 1   Delivery_status  20 non-null     object
 2   cost             20 non-null     int64
 3   stars            19 non-null     float64
 4   no_of_reviews    18 non-null     float64
dtypes: float64(2), int64(1), object(2)
memory usage: 1.5+ KB

In [106]:
## handeling the missing values
df_all["no_of_reviews"].fillna(df_all["no_of_reviews"].mean(), inplace= True)

In [107]:
df_all.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   kruti_name       20 non-null     object
 1   Delivery_status  20 non-null     object
 2   cost             20 non-null     int64
 3   stars            19 non-null     float64
 4   no_of_reviews    20 non-null     float64
dtypes: float64(2), int64(1), object(2)
memory usage: 1.5+ KB

In [108]:
df_all["stars"].fillna(df_all["stars"].mean(), inplace= True)

In [109]:
df_all.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   kruti_name       20 non-null     object
 1   Delivery_status  20 non-null     object
 2   cost             20 non-null     int64
 3   stars            20 non-null     float64
 4   no_of_reviews    20 non-null     float64
dtypes: float64(2), int64(1), object(2)
memory usage: 1.5+ KB

In [111]:
df_all.to_csv("cleaned data.csv")